JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_sci.c
/****************************************************************************
 * arch/renesas/src/rx66t/rx66t_sci.c
 *
 *   Copyright (C) 2008-2019 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/***********************************************************************************************************************
 *	Includes
 ***********************************************************************************************************************/
#include <nuttx/config.h>

#include "sys/types.h"
#include "rx66t_macrodriver.h"
#include "rx66t_sci.h"
#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"
#include "rx66t_definitions.h"

/***********************************************************************************************************************
 *	Global variables and functions
 ***********************************************************************************************************************/
static inline
void	RX_MPC_enable( void )
{
	/* Enable writing to registers related to operating modes, LPC, CGC and software reset */
	SYSTEM.PRCR.WORD = 0xA50BU;
	/* Enable writing to MPC pin function control registers */
	MPC.PWPR.BIT.B0WI = 0U;
	MPC.PWPR.BIT.PFSWE = 1U;
}

static inline
void	RX_MPC_disable( void )
{
	/* Disable writing to MPC pin function control registers */
	MPC.PWPR.BIT.PFSWE = 0U;
	MPC.PWPR.BIT.B0WI = 1U;
	/* Enable protection */
	SYSTEM.PRCR.WORD = 0xA500U;
}

#ifdef	CONFIG_RX66T_SCI1
volatile uint8_t	*gp_sci1_tx_address;			/* SCI1 transmit buffer address		*/
volatile uint8_t	*gp_sci1_rx_address;			/* SCI1 receive buffer address		*/
volatile uint16_t	g_sci1_tx_count;				/* SCI1 transmit data number		*/
volatile uint16_t	g_sci1_rx_count;				/* SCI1 receive data number			*/
volatile uint16_t	g_sci1_rx_length;				/* SCI1 receive data length			*/

static inline
void	SCI1_init_port( void )
{
	/* Set RXD1 pin (PD5) */
	MPC.PD5PFS.BYTE		= 0x0AU;
	PORTD.PMR.BIT.BT5	= 1U;
	/* Set TXD1 pin (PD3) */
	PORTD.PODR.BIT.B3	= 1U;
	MPC.PD3PFS.BYTE		= 0x0AU;
	PORTD.PDR.BIT.B3	= 1U;
	PORTD.PMR.BIT.B3	= 1U;
}
#endif	// CONFIG_RX66T_SCI1

#ifdef	CONFIG_RX66T_SCI5
volatile uint8_t	*gp_sci5_tx_address;			/* SCI5 transmit buffer address		*/
volatile uint8_t	*gp_sci5_rx_address;			/* SCI5 receive buffer address		*/
volatile uint16_t	g_sci5_tx_count;				/* SCI5 transmit data number		*/
volatile uint16_t	g_sci5_rx_count;				/* SCI5 receive data number			*/
volatile uint16_t	g_sci5_rx_length;				/* SCI5 receive data length			*/

static inline
void	SCI5_init_port( void )
{
	/* Set RXD5 pin (PE0) */
	MPC.PE0PFS.BYTE		= 0x0AU;
	PORTE.PMR.BIT.BT0	= 1U;
	/* Set TXD5 pin (PD7) */
	PORTD.PODR.BIT.B7	= 1U;
	MPC.PD7PFS.BYTE		= 0x0AU;
	PORTD.PDR.BIT.B7	= 1U;
	PORTD.PMR.BIT.B7	= 1U;
}
#endif	// CONFIG_RX66T_SCI5

#ifdef	CONFIG_RX66T_SCI6
volatile uint8_t	*gp_sci6_tx_address;			/* SCI6 transmit buffer address		*/
volatile uint8_t	*gp_sci6_rx_address;			/* SCI6 receive buffer address		*/
volatile uint16_t	g_sci6_tx_count;				/* SCI6 transmit data number		*/
volatile uint16_t	g_sci6_rx_count;				/* SCI6 receive data number			*/
volatile uint16_t	g_sci6_rx_length;				/* SCI6 receive data length			*/

static inline
void	SCI6_init_port( void )
{
	/* Set RXD6 pin (PB1) */
	MPC.PB1PFS.BYTE		= 0x0AU;
	PORTB.PMR.BIT.B1	= 1U;
	/* Set TXD6 pin (PB2) */
	PORTB.PODR.BIT.B2	= 1U;
	MPC.PB2PFS.BYTE		= 0x0AU;
	PORTB.PDR.BIT.B2	= 1U;
	PORTB.PMR.BIT.B2	= 1U;
}
#endif	// CONFIG_RX66T_SCI6

#ifdef	CONFIG_RX66T_SCI8
volatile uint8_t	*gp_sci8_tx_address;			/* SCI8 transmit buffer address		*/
volatile uint8_t	*gp_sci8_rx_address;			/* SCI8 receive buffer address		*/
volatile uint16_t	g_sci8_tx_count;				/* SCI8 transmit data number		*/
volatile uint16_t	g_sci8_rx_count;				/* SCI8 receive data number			*/
volatile uint16_t	g_sci8_rx_length;				/* SCI8 receive data length			*/

static inline
void	SCI8_init_port( void )
{
	/* Set RXD8 pin (PA5) */
	MPC.PA5PFS.BYTE		= 0x0BU;
	PORTA.PMR.BIT.B5	= 1U;
	/* Set TXD8 pin (PA4) */
	PORTA.PODR.BIT.B4	= 1U;
	MPC.PA4PFS.BYTE		= 0x0BU;
	PORTA.PDR.BIT.B4	= 1U;
	PORTA.PMR.BIT.B4	= 1U;
}
#endif	// CONFIG_RX66T_SCI8

#ifdef	CONFIG_RX66T_SCI9
volatile uint8_t	*gp_sci9_tx_address;			/* SCI9 transmit buffer address		*/
volatile uint8_t	*gp_sci9_rx_address;			/* SCI9 receive buffer address		*/
volatile uint16_t	g_sci9_tx_count;				/* SCI9 transmit data number		*/
volatile uint16_t	g_sci9_rx_count;				/* SCI9 receive data number			*/
volatile uint16_t	g_sci9_rx_length;				/* SCI9 receive data length			*/

static inline
void	SCI9_init_port( void )
{
	/* Set RXD9 pin (PA2) */
	MPC.PA2PFS.BYTE		= 0x0BU;
	PORTA.PMR.BIT.B2	= 1U;
	/* Set TXD9 pin (PA3) */
	PORTA.PODR.BIT.B3	= 1U;
	MPC.PA3PFS.BYTE		= 0x0AU;
	PORTA.PDR.BIT.B3	= 1U;
	PORTA.PMR.BIT.B3	= 1U;
}
#endif	// CONFIG_RX66T_SCI8

#ifdef	CONFIG_RX66T_SCI11
volatile uint8_t	*gp_sci11_tx_address;			/* SCI11 transmit buffer address		*/
volatile uint8_t	*gp_sci11_rx_address;			/* SCI11 receive buffer address		*/
volatile uint16_t	g_sci11_tx_count;				/* SCI11 transmit data number		*/
volatile uint16_t	g_sci11_rx_count;				/* SCI11 receive data number			*/
volatile uint16_t	g_sci11_rx_length;				/* SCI11 receive data length			*/

static inline
void	SCI11_init_port( void )
{
	/* Set RXD11 pin (PA1) */
	MPC.PA1PFS.BYTE		= 0x0BU;
	PORTA.PMR.BIT.B1	= 1U;
	/* Set TXD11 pin (PA0) */
	PORTA.PODR.BIT.BT0	= 1U;
	MPC.PA0PFS.BYTE		= 0x0BU;
	PORTA.PDR.BIT.BT0	= 1U;
	PORTA.PMR.BIT.BT0	= 1U;
}
#endif	// CONFIG_RX66T_SCI11

#ifdef	CONFIG_RX66T_SCI12
volatile uint8_t	*gp_sci12_tx_address;			/* SCI12 transmit buffer address		*/
volatile uint8_t	*gp_sci12_rx_address;			/* SCI12 receive buffer address		*/
volatile uint16_t	g_sci12_tx_count;				/* SCI12 transmit data number		*/
volatile uint16_t	g_sci12_rx_count;				/* SCI12 receive data number			*/
volatile uint16_t	g_sci12_rx_length;				/* SCI12 receive data length			*/

static inline
void	SCI12_init_port( void )
{
	/* Set RXD12 pin (P22) */
	MPC.P22PFS.BYTE		= 0x0AU;
	PORT2.PMR.BIT.B2	= 1U;
	/* Set TXD12 pin (P23) */
	PORT2.PODR.BIT.B3	= 1U;
	MPC.P23PFS.BYTE		= 0x0AU;
	PORT2.PDR.BIT.B3	= 1U;
	PORT2.PMR.BIT.B3	= 1U;
}
#endif	// CONFIG_RX66T_SCI12


#ifdef	CONFIG_RX66T_SCI1
/***********************************************************************************************************************
 * Function Name: R_SCI1_Create
 * Description  : This function initializes SCI1.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI1_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI1)			= 0U;			/* Cancel SCI1 module stop state */
	IPR(SCI1,RXI1)		= 15;			/* Set interrupt priority */
	IPR(SCI1,TXI1)		= 15;			/* Set interrupt priority */
	SCI1.SCR.BYTE		= 0U;			/* Clear the control register */
	/* Set clock enable */
	SCI1.SCR.BYTE		= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI1.SIMR1.BIT.IICM	= 0U;			/* Clear SIMR1.IICM bit */
	SCI1.SPMR.BIT.CKPH	= 0U;			/* Clear SPMR.CKPH bit */
	SCI1.SPMR.BIT.CKPOL	= 0U;			/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI1.SPMR.BYTE		= _00_SCI_RTS;
	SCI1.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI1.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI1.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI1.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI1.BRR			= 0x40U;
	SCI1.MDDR			= 255U;
	/* Set SCI1 pin */
	SCI1_init_port();
	RX_MPC_disable();
}

