JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_sci.c
/***********************************************************************************************************************
 * Function Name: R_SCI1_Start
 * Description  : This function starts SCI1.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI1_Start(void)
{
	IR(SCI1,TXI1)		= 0U;	/* Clear interrupt flag */
	IR(SCI1,RXI1)		= 0U;	/* Clear interrupt flag */
	IEN(SCI1,TXI1)		= 1U;	/* Enable SCI interrupt */
	IEN(SCI1,RXI1)		= 1U;	/* Enable SCI interrupt */
	ICU.GENBL0.BIT.EN2	= 0U;
	ICU.GENBL0.BIT.EN3	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI1_Stop
 * Description  : This function stops SCI1.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI1_Stop(void)
{
	SCI1.SCR.BIT.TE		= 0U;	/* Disable serial transmit */
	SCI1.SCR.BIT.RE		= 0U;	/* Disable serial receive */
	SCI1.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI1.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI1,TXI1)		= 0U;
	ICU.GENBL0.BIT.EN2	= 0U;
	IR(SCI1,TXI1)		= 0U;
	IEN(SCI1,RXI1)		= 0U;
	ICU.GENBL0.BIT.EN3	= 0U;
	IR(SCI1,RXI1)		= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI1_Serial_Receive
 * Description  : This function receives SCI1 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI1_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci1_rx_count		= 0U;
	g_sci1_rx_length	= rx_num;
	gp_sci1_rx_address	= rx_buf;
	SCI1.SCR.BIT.RIE	= 1U;
	SCI1.SCR.BIT.RE		= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI1_Serial_Send
 * Description  : This function transmits SCI1 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI1_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci1_tx_address	= tx_buf;
	g_sci1_tx_count		= tx_num;
	/* Set TXD1 pin */
	SCI1.SCR.BIT.TIE	= 1U;
	SCI1.SCR.BIT.TE		= 1U;
	return OK;
}
#endif

#ifdef	CONFIG_RX66T_SCI5
/***********************************************************************************************************************
 * Function Name: R_SCI5_Create
 * Description  : This function initializes SCI5.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI5_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI5)			= 0U;			/* Cancel SCI0 module stop state */
	IPR(SCI5,RXI5)		= 15;			/* Set interrupt priority */
	IPR(SCI5,TXI5)		= 15;			/* Set interrupt priority */
	SCI5.SCR.BYTE		= 0U;			/* Clear the control register */
	/* Set clock enable */
	SCI5.SCR.BYTE		= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI5.SIMR1.BIT.IICM	= 0U;			/* Clear SIMR1.IICM bit */
	SCI5.SPMR.BIT.CKPH	= 0U;			/* Clear SPMR.CKPH bit */
	SCI5.SPMR.BIT.CKPOL	= 0U;			/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI5.SPMR.BYTE		= _00_SCI_RTS;
	SCI5.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI5.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI5.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI5.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI5.BRR			= 0x40U;
	SCI5.MDDR			= 255U;
	/* Set SCI5 pin */
	SCI5_init_port();
	RX_MPC_disable();
}

/***********************************************************************************************************************
 * Function Name: R_SCI5_Start
 * Description  : This function starts SCI5.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI5_Start(void)
{
	IR(SCI5,TXI5)		= 0U;	/* Clear interrupt flag */
	IR(SCI5,RXI5)		= 0U;	/* Clear interrupt flag */
	IEN(SCI5,TXI5)		= 1U;	/* Enable SCI interrupt */
	IEN(SCI5,RXI5)		= 1U;	/* Enable SCI interrupt */
	ICU.GENBL0.BIT.EN10	= 0U;
	ICU.GENBL0.BIT.EN11	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI5_Stop
 * Description  : This function stops SCI5.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI5_Stop(void)
{
	SCI5.SCR.BIT.TE		= 0U;	/* Disable serial transmit */
	SCI5.SCR.BIT.RE		= 0U;	/* Disable serial receive */
	SCI5.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI5.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI5,TXI5)		= 0U;
	ICU.GENBL0.BIT.EN10	= 0U;
	IR(SCI5,TXI5)		= 0U;
	IEN(SCI5,RXI5)		= 0U;
	ICU.GENBL0.BIT.EN11	= 0U;
	IR(SCI5,RXI5)		= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI5_Serial_Receive
 * Description  : This function receives SCI5 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI5_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci5_rx_count		= 0U;
	g_sci5_rx_length	= rx_num;
	gp_sci5_rx_address	= rx_buf;
	SCI5.SCR.BIT.RIE	= 1U;
	SCI5.SCR.BIT.RE		= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI5_Serial_Send
 * Description  : This function transmits SCI5 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI5_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci5_tx_address	= tx_buf;
	g_sci5_tx_count		= tx_num;
	/* Set TXD5 pin */
	SCI5.SCR.BIT.TIE	= 1U;
	SCI5.SCR.BIT.TE		= 1U;
	return OK;
}
#endif

#ifdef	CONFIG_RX66T_SCI6
/***********************************************************************************************************************
 * Function Name: R_SCI6_Create
 * Description  : This function initializes SCI6.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI6_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI6)			= 0U;			/* Cancel SCI0 module stop state */
	IPR(SCI6,RXI6)		= 15;			/* Set interrupt priority */
	IPR(SCI6,TXI6)		= 15;			/* Set interrupt priority */
	SCI6.SCR.BYTE		= 0U;			/* Clear the control register */
	/* Set clock enable */
	SCI6.SCR.BYTE		= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI6.SIMR1.BIT.IICM	= 0U;			/* Clear SIMR1.IICM bit */
	SCI6.SPMR.BIT.CKPH	= 0U;			/* Clear SPMR.CKPH bit */
	SCI6.SPMR.BIT.CKPOL	= 0U;			/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI6.SPMR.BYTE		= _00_SCI_RTS;
	SCI6.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI6.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI6.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI6.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI6.BRR			= 0x40U;
	SCI6.MDDR			= 255U;
	/* Set SCI6 pin */
	SCI6_init_port();
	RX_MPC_disable();
}

