JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_sci.c
/***********************************************************************************************************************
 * Function Name: R_SCI6_Start
 * Description  : This function starts SCI6.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI6_Start(void)
{
	IR(SCI6,TXI6)		= 0U;	/* Clear interrupt flag */
	IR(SCI6,RXI6)		= 0U;	/* Clear interrupt flag */
	IEN(SCI6,TXI6)		= 1U;	/* Enable SCI interrupt */
	IEN(SCI6,RXI6)		= 1U;	/* Enable SCI interrupt */
	ICU.GENBL0.BIT.EN12	= 0U;
	ICU.GENBL0.BIT.EN13	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI6_Stop
 * Description  : This function stops SCI6.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI6_Stop(void)
{
	SCI6.SCR.BIT.TE		= 0U;	/* Disable serial transmit */
	SCI6.SCR.BIT.RE		= 0U;	/* Disable serial receive */
	SCI6.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI6.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI6,TXI6)		= 0U;
	ICU.GENBL0.BIT.EN12	= 0U;
	IR(SCI6,TXI6)		= 0U;
	IEN(SCI6,RXI6)		= 0U;
	ICU.GENBL0.BIT.EN13	= 0U;
	IR(SCI6,RXI6)		= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI6_Serial_Receive
 * Description  : This function receives SCI6 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI6_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci6_rx_count		= 0U;
	g_sci6_rx_length	= rx_num;
	gp_sci6_rx_address	= rx_buf;
	SCI6.SCR.BIT.RIE	= 1U;
	SCI6.SCR.BIT.RE		= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI6_Serial_Send
 * Description  : This function transmits SCI6 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI6_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci6_tx_address	= tx_buf;
	g_sci6_tx_count		= tx_num;
	/* Set TXD0 pin */
	SCI6.SCR.BIT.TIE	= 1U;
	SCI6.SCR.BIT.TE		= 1U;
	return OK;
}
#endif

#ifdef	CONFIG_RX66T_SCI8
/***********************************************************************************************************************
 * Function Name: R_SCI8_Create
 * Description  : This function initializes SCI8.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI8_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI8)			= 0U;			/* Cancel SCI8 module stop state */
	IPR(SCI8,RXI8)		= 15;			/* Set interrupt priority */
	IPR(SCI8,TXI8)		= 15;			/* Set interrupt priority */
	SCI8.SCR.BYTE		= 0U;			/* Clear the control register */
	/* Set clock enable */
	SCI8.SCR.BYTE		= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI8.SIMR1.BIT.IICM	= 0U;			/* Clear SIMR1.IICM bit */
	SCI8.SPMR.BIT.CKPH	= 0U;			/* Clear SPMR.CKPH bit */
	SCI8.SPMR.BIT.CKPOL	= 0U;			/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI8.SPMR.BYTE		= _00_SCI_RTS;
	SCI8.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI8.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI8.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI8.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI8.BRR			= 0x40U;
	SCI8.MDDR			= 255U;
	/* Set SCI8 pin */
	SCI8_init_port();
	RX_MPC_disable();
}

/***********************************************************************************************************************
 * Function Name: R_SCI8_Start
 * Description  : This function starts SCI8.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI8_Start(void)
{
	IR(SCI8,TXI8)		= 0U;	/* Clear interrupt flag */
	IR(SCI8,RXI8)		= 0U;	/* Clear interrupt flag */
	IEN(SCI8,TXI8)		= 1U;	/* Enable SCI interrupt */
	IEN(SCI8,RXI8)		= 1U;	/* Enable SCI interrupt */
	ICU.GENBL1.BIT.EN24	= 0U;
	ICU.GENBL1.BIT.EN25	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI8_Stop
 * Description  : This function stops SCI8.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI8_Stop(void)
{
	SCI8.SCR.BIT.TE		= 0U;	/* Disable serial transmit */
	SCI8.SCR.BIT.RE		= 0U;	/* Disable serial receive */
	SCI8.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI8.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI8,TXI8)		= 0U;
	IR(SCI8,TXI8)		= 0U;
	IEN(SCI8,RXI8)		= 0U;
	IR(SCI8,RXI8)		= 0U;
	ICU.GENBL1.BIT.EN24	= 0U;
	ICU.GENBL1.BIT.EN25	= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI8_Serial_Receive
 * Description  : This function receives SCI8 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI8_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci8_rx_count		= 0U;
	g_sci8_rx_length	= rx_num;
	gp_sci8_rx_address	= rx_buf;
	SCI8.SCR.BIT.RIE	= 1U;
	SCI8.SCR.BIT.RE		= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI8_Serial_Send
 * Description  : This function transmits SCI8 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI8_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci8_tx_address	= tx_buf;
	g_sci8_tx_count		= tx_num;
	/* Set TXD0 pin */
	SCI8.SCR.BIT.TIE	= 1U;
	SCI8.SCR.BIT.TE		= 1U;
	return OK;
}
#endif

