JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_sci.c
#ifdef	CONFIG_RX66T_SCI9
/***********************************************************************************************************************
 * Function Name: R_SCI9_Create
 * Description  : This function initializes SCI9.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI9_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI9)			= 0U;			/* Cancel SCI8 module stop state */
	IPR(SCI9,RXI9)		= 15;			/* Set interrupt priority */
	IPR(SCI9,TXI9)		= 15;			/* Set interrupt priority */
	SCI9.SCR.BYTE		= 0U;			/* Clear the control register */
	/* Set clock enable */
	SCI9.SCR.BYTE		= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI9.SIMR1.BIT.IICM	= 0U;			/* Clear SIMR1.IICM bit */
	SCI9.SPMR.BIT.CKPH	= 0U;			/* Clear SPMR.CKPH bit */
	SCI9.SPMR.BIT.CKPOL	= 0U;			/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI9.SPMR.BYTE		= _00_SCI_RTS;
	SCI9.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI9.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI9.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI9.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI9.BRR			= 0x40U;
	SCI9.MDDR			= 255U;
	/* Set SCI8 pin */
	SCI9_init_port();
	RX_MPC_disable();
}

/***********************************************************************************************************************
 * Function Name: R_SCI9_Start
 * Description  : This function starts SCI9.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI9_Start(void)
{
	IR(SCI9,TXI9)		= 0U;	/* Clear interrupt flag */
	IR(SCI9,RXI9)		= 0U;	/* Clear interrupt flag */
	IEN(SCI9,TXI9)		= 1U;	/* Enable SCI interrupt */
	IEN(SCI9,RXI9)		= 1U;	/* Enable SCI interrupt */
	ICU.GENBL1.BIT.EN26	= 0U;
	ICU.GENBL1.BIT.EN27	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI9_Stop
 * Description  : This function stops SCI9.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI9_Stop(void)
{
	SCI9.SCR.BIT.TE		= 0U;	/* Disable serial transmit */
	SCI9.SCR.BIT.RE		= 0U;	/* Disable serial receive */
	SCI9.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI9.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI9,TXI9)		= 0U;
	IR(SCI9,TXI9)		= 0U;
	IEN(SCI9,RXI9)		= 0U;
	IR(SCI9,RXI9)		= 0U;
	ICU.GENBL1.BIT.EN26	= 0U;
	ICU.GENBL1.BIT.EN27	= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI9_Serial_Receive
 * Description  : This function receives SCI9 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI9_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci9_rx_count		= 0U;
	g_sci9_rx_length	= rx_num;
	gp_sci9_rx_address	= rx_buf;
	SCI9.SCR.BIT.RIE	= 1U;
	SCI9.SCR.BIT.RE		= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI9_Serial_Send
 * Description  : This function transmits SCI9 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI9_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci9_tx_address	= tx_buf;
	g_sci9_tx_count		= tx_num;
	/* Set TXD0 pin */
	SCI9.SCR.BIT.TIE	= 1U;
	SCI9.SCR.BIT.TE		= 1U;
	return OK;
}
#endif

#ifdef	CONFIG_RX66T_SCI11
/***********************************************************************************************************************
 * Function Name: R_SCI11_Create
 * Description  : This function initializes SCI11.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI11_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI11)			= 0U;			/* Cancel SCI11 module stop state */
	IPR(SCI11,RXI11)	= 15;			/* Set interrupt priority */
	IPR(SCI11,TXI11)	= 15;			/* Set interrupt priority */
	SCI11.SCR.BYTE		= 0U;			/* Clear the control register */
#if 1
	/* Set clock enable */
	SCI11.SCR.BYTE			= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI11.SIMR1.BIT.IICM	= 0U;		/* Clear SIMR1.IICM bit */
	SCI11.SPMR.BIT.CKPH		= 0U;		/* Clear SPMR.CKPH bit */
	SCI11.SPMR.BIT.CKPOL	= 0U;		/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI11.SPMR.BYTE		= _00_SCI_RTS;
	SCI11.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI11.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI11.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI11.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI11.BRR			= 0x40U;
	SCI11.MDDR			= 255U;
#else
	/* Set clock enable */
	SCI11.SCR.BYTE			= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI11.SIMR1.BIT.IICM	= 0U;
	SCI11.SPMR.BYTE			= 0U;
	/* Set control registers */
	SCI11.SMR.BYTE		= _01_SCI_CLOCK_PCLK_4 | _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_STOP_1 |
						  _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI11.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_INVERT_NONE | _00_SCI_DATA_LSB_FIRST |
						  _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI11.SEMR.BYTE		= _00_SCI_BIT_MODULATION_DISABLE | _08_SCI_6_BASE_CLOCK | _20_SCI_NOISE_FILTER_ENABLE |
						  _80_SCI_FALLING_EDGE_START_BIT;
	SCI11.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI11.BRR			= 0x04U;
#endif
	/* Set SCI1 pin */
	SCI11_init_port();
	RX_MPC_disable();
}

