JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_sci.c
/***********************************************************************************************************************
 * Function Name: R_SCI11_Start
 * Description  : This function starts SCI11.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI11_Start(void)
{
	IR(SCI11,TXI11)		= 0U;	/* Clear interrupt flag */
	IR(SCI11,RXI11)		= 0U;	/* Clear interrupt flag */
	IEN(SCI11,TXI11)	= 1U;	/* Enable SCI interrupt */
	IEN(SCI11,RXI11)	= 1U;	/* Enable SCI interrupt */
	ICU.GENBL0.BIT.EN12	= 0U;
	ICU.GENBL0.BIT.EN13	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI11_Stop
 * Description  : This function stops SCI1.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI11_Stop(void)
{
	SCI11.SCR.BIT.TE	= 0U;	/* Disable serial transmit */
	SCI11.SCR.BIT.RE	= 0U;	/* Disable serial receive */
	SCI11.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI11.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI11,TXI11)	= 0U;
	IEN(SCI11,RXI11)	= 0U;
	IR(SCI11,TXI11)		= 0U;
	IR(SCI11,RXI11)		= 0U;
	ICU.GENBL0.BIT.EN12	= 0U;
	ICU.GENBL0.BIT.EN13	= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI11_Serial_Receive
 * Description  : This function receives SCI11 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI11_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci11_rx_count	= 0U;
	g_sci11_rx_length	= rx_num;
	gp_sci11_rx_address	= rx_buf;
	SCI11.SCR.BIT.RIE	= 1U;
	SCI11.SCR.BIT.RE	= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI11_Serial_Send
 * Description  : This function transmits SCI11 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI11_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci11_tx_address	= tx_buf;
	g_sci11_tx_count	= tx_num;
	/* Set TXD11 pin */
	SCI11.SCR.BIT.TIE	= 1U;
	SCI11.SCR.BIT.TE	= 1U;
	return OK;
}
#endif

#ifdef	CONFIG_RX66T_SCI12
/***********************************************************************************************************************
 * Function Name: R_SCI12_Create
 * Description  : This function initializes SCI12.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI12_Create(void)
{
	RX_MPC_enable();
	MSTP(SCI12)			= 0U;			/* Cancel SCI1 module stop state */
	IPR(SCI12,RXI12)	= 15;			/* Set interrupt priority */
	IPR(SCI12,TXI12)	= 15;			/* Set interrupt priority */
	SCI12.SCR.BYTE		= 0U;			/* Clear the control register */
	/* Set clock enable */
	SCI12.SCR.BYTE			= _00_SCI_INTERNAL_SCK_UNUSED;
	SCI12.SIMR1.BIT.IICM	= 0U;		/* Clear SIMR1.IICM bit */
	SCI12.SPMR.BIT.CKPH		= 0U;		/* Clear SPMR.CKPH bit */
	SCI12.SPMR.BIT.CKPOL	= 0U;		/* Clear SPMR.CKPOL bit */
	/* Set control registers */
	SCI12.SPMR.BYTE		= _00_SCI_RTS;
	SCI12.SMR.BYTE		= _00_SCI_CLOCK_PCLK | _00_SCI_STOP_1 | _00_SCI_PARITY_DISABLE | _00_SCI_DATA_LENGTH_8 |
						  _00_SCI_MULTI_PROCESSOR_DISABLE | _00_SCI_ASYNCHRONOUS_OR_I2C_MODE;
	SCI12.SCMR.BYTE		= _00_SCI_SERIAL_MODE | _00_SCI_DATA_LSB_FIRST | _10_SCI_DATA_LENGTH_8_OR_7 | _62_SCI_SCMR_DEFAULT;
	SCI12.SEMR.BYTE		= _80_SCI_FALLING_EDGE_START_BIT | _20_SCI_NOISE_FILTER_ENABLE | _10_SCI_8_BASE_CLOCK |
						  _40_SCI_BAUDRATE_DOUBLE | _04_SCI_BIT_MODULATION_ENABLE;
	SCI12.SNFR.BYTE		= _00_SCI_ASYNC_DIV_1;
	/* Set bit rate */
	SCI12.BRR			= 0x40U;
	SCI12.MDDR			= 255U;
	/* Set SCI1 pin */
	SCI12_init_port();
	RX_MPC_disable();
}

/***********************************************************************************************************************
 * Function Name: R_SCI12_Start
 * Description  : This function starts SCI12.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI12_Start(void)
{
	IR(SCI12,TXI12)		= 0U;	/* Clear interrupt flag */
	IR(SCI12,RXI12)		= 0U;	/* Clear interrupt flag */
	IEN(SCI12,TXI12)	= 1U;	/* Enable SCI interrupt */
	IEN(SCI12,RXI12)	= 1U;	/* Enable SCI interrupt */
	ICU.GENBL0.BIT.EN16	= 0U;
	ICU.GENBL0.BIT.EN17	= 1U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI12_Stop
 * Description  : This function stops SCI12.
 * Arguments    : None
 * Return Value : None
 ***********************************************************************************************************************/
void	R_SCI12_Stop(void)
{
	SCI12.SCR.BIT.TE	= 0U;	/* Disable serial transmit */
	SCI12.SCR.BIT.RE	= 0U;	/* Disable serial receive */
	SCI12.SCR.BIT.TIE	= 0U;	/* disable TXI interrupt */
	SCI12.SCR.BIT.RIE	= 0U;	/* disable RXI and ERI interrupt */
	IEN(SCI12,TXI12)	= 0U;
	IEN(SCI12,RXI12)	= 0U;
	IR(SCI12,TXI12)		= 0U;
	IR(SCI12,RXI12)		= 0U;
	ICU.GENBL0.BIT.EN16	= 0U;
	ICU.GENBL0.BIT.EN17	= 0U;
}

/***********************************************************************************************************************
 * Function Name: R_SCI12_Serial_Receive
 * Description  : This function receives SCI12 data.
 * Arguments    : rx_buf - receive buffer pointer
 *                rx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI12_Serial_Receive(uint8_t * const rx_buf, uint16_t rx_num)
{
	if(1U > rx_num) {
		return MD_ARGERROR;
	}
	g_sci12_rx_count	= 0U;
	g_sci12_rx_length	= rx_num;
	gp_sci12_rx_address	= rx_buf;
	SCI12.SCR.BIT.RIE	= 1U;
	SCI12.SCR.BIT.RE	= 1U;
	return OK;
}
/***********************************************************************************************************************
 * Function Name: R_SCI12_Serial_Send
 * Description  : This function transmits SCI12 data.
 * Arguments    : tx_buf - transfer buffer pointer
 *                tx_num - buffer size
 * Return Value : status - MD_OK or MD_ARGERROR
 ***********************************************************************************************************************/
MD_STATUS	R_SCI12_Serial_Send(uint8_t * const tx_buf, uint16_t tx_num)
{
	if(1U > tx_num) {
		return MD_ARGERROR;
	}
	gp_sci12_tx_address	= tx_buf;
	g_sci12_tx_count	= tx_num;
	/* Set TXD12 pin */
	SCI12.SCR.BIT.TIE	= 1U;
	SCI12.SCR.BIT.TE	= 1U;
	return OK;
}
#endif
